# basics

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions' # add repo for google-chrome-canary
tap 'homebrew/command-not-found'

brew 'zsh'
brew 'htop-osx'
brew 'curl'
brew 'phraseapp'
brew 'git'
brew 'hub'
brew 'gist'
brew 'autojump'
brew 'python'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'ruby'
brew 'nginx'
brew 'dnsmasq'
brew 'watch'
brew 'mas' # install apps from Mac App Store
cask 'keepingyouawake' # caffeine clone more updated

# Editors, terminals, viewers

brew 'vim', args: ['with-override-system-vi']
brew 'diff-so-fancy'
cask 'visual-studio-code'
cask 'iterm2'
# cask 'mou' # this didn't work in Sierra
cask 'wireshark'

# Comunication

cask 'telegram'
cask 'hipchat'

# Browsers

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'

# Design, Music

cask 'pencil'
cask 'spotify'
cask 'vlc'

# App store

mas 'Twitter', id: 409789998
# mas 'Giphy Capture', id: 668208984 # Last time this didn't work
mas 'Xcode', id: 497799835 # this installation requires a lot of time (> 10min)
